pkg/wsman/wsmantesting/responses/cim/physical/processor/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Processor"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000E88</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Processor</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_Processor>
            <g:CPUStatus>1</g:CPUStatus>
            <g:CreationClassName>CIM_Processor</g:CreationClassName>
            <g:CurrentClockSpeed>2400</g:CurrentClockSpeed>
            <g:DeviceID>CPU 0</g:DeviceID>
            <g:ElementName>Managed System CPU</g:ElementName>
            <g:EnabledState>2</g:EnabledState>
            <g:ExternalBusClockSpeed>100</g:ExternalBusClockSpeed>
            <g:Family>198</g:Family>
            <g:HealthState>0</g:HealthState>
            <g:MaxClockSpeed>8300</g:MaxClockSpeed>
            <g:OperationalStatus>0</g:OperationalStatus>
            <g:OtherFamilyDescription></g:OtherFamilyDescription>
            <g:RequestedState>12</g:RequestedState>
            <g:Role>Central</g:Role>
            <g:Stepping>13</g:Stepping>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>ManagedSystem</g:SystemName>
            <g:UpgradeMethod>52</g:UpgradeMethod>
        </g:CIM_Processor>
    </a:Body>
</a:Envelope>